QHDattractor_halocline/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

Nx 200;
Ny 200;
Nz 1;

H 0.4;
L 0.6;
d 0.5;
w50 #calc "($L/2/$Nx)";
xs  #calc "$L*0.5*(1+$d)";


vertices
(
    (0    0  -$w50)  //0
    (-$xs 0  -$w50)  //1
    (0    $H -$w50)  //2
    (-$L  $H -$w50)  //3
    (0    0   $w50)  //4
    (-$xs 0   $w50)  //5
    (0    $H  $w50)  //6
    (-$L  $H  $w50)  //7
);

blocks
(
    hex (1 0 2 3 5 4 6 7) ($Nx $Ny $Nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }
    left
    {
        type wall;
        faces
        (
            (0 4 6 2)
        );
    } 
    
    right
    {
        type wall;
        faces
        (
            (1 5 7 3)
        );
    }
    down
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (4 6 7 5)
            (0 1 3 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
